example/elbow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu                [0 2 -1 0 0 0 0] 1.0;
rho               [1 -3 0 0 0 0 0] 1;
// k                 [1 1 -3 -1 0 0 0] 0.6;
// Cp                [0 2 -2 -1 0 0 0] 4182;
kappa           [0 2 -1 0 0 0 0] 0.001;


// ************************************************************************* //
