example/elbow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         1000;
    }

    U
    {
        solver          smoothSolver;
        smoother        DILU;
        tolerance       1e-05;
        relTol          0;
        maxIter         100;
    }

    T
    {
        solver          smoothSolver;
        smoother        DILU;
        tolerance       1e-05;
        relTol          0;
        maxIter         100;
    }
}

SIMPLE
{
    nCorrectors     1;
    residualControl
    {
        p               0.0001;
        U               0.0001;
        T               0.0001;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    // pRefCell        0;
    // pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    } 
    equations 
    { 
        U               0.7; 
        T               0.9; 
    } 
} 


// ************************************************************************* //
